# LineLightShape Constructor (LineLightShape) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLightShape Constructor (LineLightShape)
LineLightShape Class See Also
---
Creates a copy of the given line light shape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LineLightShape(
	LineLightShape other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As LineLightShape _
)
```

Visual C++
---
```text
public:
LineLightShape(
	LineLightShape^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..LineLightShape
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LineLightShape Class
LineLightShape Overload
Autodesk.Revit.DB.Lighting Namespace